# Ultralytics YOLO11 + RDD-RGNet + Sandwich Neck + P2 Detection Head + StripConvAttention + WIoU
#
# 设计目标：
#   1. 保留当前最强分支 strip-wiou 的方向感知注意力与 WIoU 回归
#   2. 引入 P2/4 检测头，专门补 D00/D10 这类更小、更细的裂缝
#   3. 使用 sandwich neck 融合浅层细节、当前层语义和深层上下文
#   4. 继续沿用 RDD-RGNet 的 First-RG / Second-RG 两阶段 region guidance 思路
#
# Backbone 层编号: 0-10
#   P2: 层 2  (C3k2 256,  stride 4)
#   P3: 层 4  (C3k2 512,  stride 8)
#   P4: 层 6  (C3k2 512,  stride 16)
#   P5: 层 10 (C2PSA 1024, stride 32)
#
# First-RG 自定义层号:
#   rdd_rg_mask_conv = 23
#   rdd_rg_attention = 24
#   rdd_rg_first_pass_end = 25
#   rdd_rg_inject = 3

nc: 80
rdd_rg: true
wiou: true
rdd_rg_first_pass_end: 25
rdd_rg_mask_conv: 23
rdd_rg_attention: 24
rdd_rg_inject: 3

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  # ========== Sandwich Top-down: P5 -> P4 -> P3 -> P2 ==========

  # P4 sandwich = P5 up + backbone P4 + P3 down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, DWSConvDown, [512, 7]]
  - [[12, 6, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  # P3 sandwich = P4 sandwich up + backbone P3 + P2 down
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, DWSConvDown, [256, 7]]
  - [[16, 4, 15], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  # P2 top-down
  - [18, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  # ========== First-RG ==========
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, nn.Conv2d, [1, 3, 1, 1]]
  - [22, 1, binary_spatial_Attention, []]

  # ========== PAN Bottom-up: P2 -> P3 -> P4 -> P5 ==========
  - [21, 1, Conv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  # ========== Second-RG ==========
  # P2 / P3 两个高分辨率分支优先强化条带方向信息，瞄准 D00/D10
  # P4 / P5 保留同样的 strip attention，使 D20/D40 的定位收益继续保留
  - [[21, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, StripConvAttention, [256]]

  - [[27, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, StripConvAttention, [256]]

  - [[30, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, StripConvAttention, [512]]

  - [[33, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, StripConvAttention, [1024]]

  # ========== Detect ==========
  - [[36, 39, 42, 45], 1, Detect, [nc]]
