# Ultralytics YOLO11 + RDD-RGNet + Sandwich Neck + P2 Detection Head
#
# 基于 yolo11-rg.yaml，改动：
#   1. Neck top-down 改为三明治结构（深层↑ + 当前层 + 浅层↓ 三路 Concat）
#   2. 三明治下采样使用 DWSConvDown（Drone-YOLO 大核深度可分离卷积，k=7）
#   3. Top-down 延伸到 P2 级别
#   4. PAN bottom-up 从 P2 开始
#   5. Second-RG 增加 P2 级别的 RFF + CoordAtt
#   6. Detect 输出 P2/P3/P4/P5 四头
#
# Backbone 层编号: 0-10（与 yolo11-rg.yaml 完全一致）
#   P2: 层 2 (C3k2 256, stride 4,  H/4)
#   P3: 层 4 (C3k2 512, stride 8,  H/8)
#   P4: 层 6 (C3k2 512, stride 16, H/16)
#   P5: 层 10 (C2PSA 1024, stride 32, H/32)
#
# First-RG 硬编码层号（通过 YAML 配置传入 tasks.py）:
#   rdd_rg_mask_conv = 23, rdd_rg_attention = 24
#   rdd_rg_first_pass_end = 25, rdd_rg_inject = 3

scale: n
nc: 80
rdd_rg: true
rdd_rg_first_pass_end: 25
rdd_rg_mask_conv: 23
rdd_rg_attention: 24
rdd_rg_inject: 3

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # 0: Conv 64, stride 2 → H/2
  - [-1, 1, Conv, [64, 3, 2]]
  # 1: Conv 128, stride 2 → H/4
  - [-1, 1, Conv, [128, 3, 2]]
  # 2: C3k2 256 → H/4 (P2)
  - [-1, 2, C3k2, [256, False, 0.25]]
  # 3: Conv 256, stride 2 → H/8
  - [-1, 1, Conv, [256, 3, 2]]
  # 4: C3k2 512 → H/8 (P3)
  - [-1, 2, C3k2, [512, False, 0.25]]
  # 5: Conv 512, stride 2 → H/16
  - [-1, 1, Conv, [512, 3, 2]]
  # 6: C3k2 512 → H/16 (P4)
  - [-1, 2, C3k2, [512, True]]
  # 7: Conv 1024, stride 2 → H/32
  - [-1, 1, Conv, [1024, 3, 2]]
  # 8: C3k2 1024 → H/32
  - [-1, 2, C3k2, [1024, True]]
  # 9: SPPF 1024 → H/32
  - [-1, 1, SPPF, [1024, 5]]
  # 10: C2PSA 1024 → H/32 (P5)
  - [-1, 2, C2PSA, [1024]]

head:
  # ========== 三明治 Top-down: P5 → P4 → P3 → P2 ==========

  # --- Sandwich stage 1: 生成 P4 级特征 ---
  # 三路: P5↑ + P4(层6) + P3↓(DWSConvDown)
  # 11: P5 上采样 2× → H/16
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # 12: P3(层4, H/8) DWSConvDown → H/16
  - [4, 1, DWSConvDown, [512, 7]]
  # 13: Concat(P3↓, P4, P5↑)
  - [[12, 6, 11], 1, Concat, [1]]
  # 14: C3k2 融合 → P4 sandwich (H/16, 512ch)
  - [-1, 2, C3k2, [512, False]]

  # --- Sandwich stage 2: 生成 P3 级特征 ---
  # 三路: P4_sw↑ + P3(层4) + P2↓(DWSConvDown)
  # 15: P4_sandwich(层14) 上采样 2× → H/8
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]
  # 16: P2(层2, H/4) DWSConvDown → H/8
  - [2, 1, DWSConvDown, [256, 7]]
  # 17: Concat(P2↓, P3, P4↑)
  - [[16, 4, 15], 1, Concat, [1]]
  # 18: C3k2 融合 → P3 sandwich (H/8, 256ch)
  - [-1, 2, C3k2, [256, False]]

  # --- Top-down stage 3: 生成 P2 级特征 ---
  # P2 是最浅层，只做双路: P3_sw↑ + P2
  # 19: P3_sandwich(层18) 上采样 2× → H/4
  - [18, 1, nn.Upsample, [None, 2, "nearest"]]
  # 20: Concat(P3↑, P2(层2))
  - [[-1, 2], 1, Concat, [1]]
  # 21: C3k2 → P2 输出 (H/4, 256ch)
  - [-1, 2, C3k2, [256, False]]

  # ========== First-RG: 掩码预测 + 空间注意力 ==========
  # P2 已经是 H/4，和注入点(层3输入)尺寸匹配，无需额外上采样
  # 22: C3k2 精炼 P2 (H/4, 256ch)
  - [-1, 2, C3k2, [256, False]]
  # 23: nn.Conv2d 输出单通道 mask (H/4)  ← rdd_rg_mask_conv
  - [-1, 1, nn.Conv2d, [1, 3, 1, 1]]
  # 24: binary_spatial_Attention (H/4, 256ch)  ← rdd_rg_attention
  - [22, 1, binary_spatial_Attention, []]

  # ========== PAN Bottom-up: P2 → P3 → P4 → P5 ==========

  # --- P2 → P3 ---
  # 25: P2(层21) 下采样 → H/8
  - [21, 1, Conv, [256, 3, 2]]
  # 26: Concat(P2↓, P3_sandwich(层18))
  - [[-1, 18], 1, Concat, [1]]
  # 27: C3k2 → PAN P3
  - [-1, 2, C3k2, [256, False]]

  # --- P3 → P4 ---
  # 28: 下采样 → H/16
  - [-1, 1, Conv, [512, 3, 2]]
  # 29: Concat(P3↓, P4_sandwich(层14))
  - [[-1, 14], 1, Concat, [1]]
  # 30: C3k2 → PAN P4
  - [-1, 2, C3k2, [512, False]]

  # --- P4 → P5 ---
  # 31: 下采样 → H/32
  - [-1, 1, Conv, [512, 3, 2]]
  # 32: Concat(P4↓, P5(层10))
  - [[-1, 10], 1, Concat, [1]]
  # 33: C3k2 → PAN P5
  - [-1, 2, C3k2, [1024, True]]

  # ========== Second-RG: RFF + CoordAtt (四组) ==========

  # --- RFF P2 ---
  # 34: Concat(top-down P2(层21), backbone P2(层2))
  - [[21, 2], 1, Concat, [1]]
  # 35: C3k2
  - [-1, 2, C3k2, [256, False]]
  # 36: CoordAtt
  - [-1, 1, CoordAtt, [256]]

  # --- RFF P3 ---
  # 37: Concat(PAN P3(层27), backbone P3(层4))
  - [[27, 4], 1, Concat, [1]]
  # 38: C3k2
  - [-1, 2, C3k2, [256, False]]
  # 39: CoordAtt
  - [-1, 1, CoordAtt, [256]]

  # --- RFF P4 ---
  # 40: Concat(PAN P4(层30), backbone P4(层6))
  - [[30, 6], 1, Concat, [1]]
  # 41: C3k2
  - [-1, 2, C3k2, [512, False]]
  # 42: CoordAtt
  - [-1, 1, CoordAtt, [512]]

  # --- RFF P5 ---
  # 43: Concat(PAN P5(层33), backbone P5(层10))
  - [[33, 10], 1, Concat, [1]]
  # 44: C3k2
  - [-1, 2, C3k2, [1024, True]]
  # 45: CoordAtt
  - [-1, 1, CoordAtt, [1024]]

  # ========== Detect: P2/P3/P4/P5 四头输出 ==========
  # 46: Detect
  - [[36, 39, 42, 45], 1, Detect, [nc]]
