# Ultralytics YOLO11 + RDD-RGNet + P2 Tiny Head + DySample + StripConvAttention + WIoU
#
# 设计原则：
# 1. 保留 RG11 的两阶段 region guidance，不改 First-RG / Second-RG 的主逻辑
# 2. 保留已经验证过有效的 StripConvAttention + WIoU
# 3. 新增 /4 的 P2 tiny head，优先补 D00 / D10 这类更细的小目标裂缝
# 4. 用 DySample 替换 top-down 上采样，改善高分辨率特征对齐
#
# Backbone 层编号:
#   2  -> P2/4
#   4  -> P3/8
#   6  -> P4/16
#   10 -> P5/32
#
# First-RG 自定义层号:
#   rdd_rg_mask_conv = 20
#   rdd_rg_attention = 21
#   rdd_rg_first_pass_end = 22
#   rdd_rg_inject = 3

scale: n
nc: 80
rdd_rg: true
wiou: true
rdd_rg_first_pass_end: 22
rdd_rg_mask_conv: 20
rdd_rg_attention: 21
rdd_rg_inject: 3

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  # Top-down: P5 -> P4 -> P3 -> P2
  - [-1, 1, DySample, [1024, 2, 4]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, DySample, [512, 2, 4]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, DySample, [256, 2, 4]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  # First-RG
  - [-1, 1, nn.Conv2d, [1, 3, 1, 1]]
  - [19, 1, binary_spatial_Attention, []]

  # Bottom-up PAN: P2 -> P3 -> P4 -> P5
  - [21, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  # Second-RG
  - [[21, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, StripConvAttention, [256]]

  - [[24, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, StripConvAttention, [256]]

  - [[27, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, StripConvAttention, [512]]

  - [[30, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, StripConvAttention, [1024]]

  - [[33, 36, 39, 42], 1, Detect, [nc]]
